app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "rating", "description", "director", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "The Room"], ["rating", "PG"], ["description", ""], ["director", "Tommy Wiseau"], ["created_at", "2019-03-07 22:04:50.717485"], ["updated_at", "2019-03-07 22:04:50.717485"]]
---
  def create
    @movie = Movie.create!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
---
  def director
    @movie = Movie.find params[:id]